# Content

### Series
### DataFrames
### Missing Data
### GroupBy
### Merging,Joining and Concatenating
### Operations
### Data Input and OutPut

# Series

In [2]:
# Difference between Numpy array and series is : series can be indexed by label

import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

#pandas can take almost any type of object

In [4]:
pd.Series(my_data,labels)  #(Data , Index)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(d) #key of the dictionary will be the index

a    10
b    20
c    30
dtype: int64

In [8]:
ser1= pd.Series([1,2,3,4],['USA','Germany', 'USSR', 'Japan'])
ser2= pd.Series([1,2,5,4],['USA','Germany', 'Italy', 'Japan'])

In [9]:
ser1['USA'] #[index]

1

In [10]:
ser1 + ser2 
#NaN = where ever it cannot find a match
# integers would be convert to float

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames

In [3]:
from numpy.random import randn
np.random.seed(101)

df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Columns

In [5]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [6]:
# Not Recommended (SQL Syntax)
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [7]:
df[['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967

In [9]:
type(df['W']) 
#sum of Serieses = DataFrame

pandas.core.series.Series

In [18]:
# Creating new column
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [19]:
# Removing Columns
# Axis =1 for columns and 0 for rows
df.drop('new', axis =1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df
# Not inplace until specified!

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [21]:
df.drop('new', axis =1,inplace = True ) 
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Rows

In [22]:
# Removing
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [23]:
# Number of rows and columns
df.shape

(5, 4)

In [24]:
# Selecting rows based on labels
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [25]:
# Slecting rows based on positon and index
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [26]:
df.loc['B','Y']

-0.8480769834036315

In [27]:
df.loc[['B','C'],['W','Z']]

          W         Z
B  0.651118  0.605965
C -2.018168 -0.589001

### Conditional Selecting

In [4]:
df > 0

# Return boolean values

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [6]:
booldf = df> 0
df[df>0]

# NaN stands for False values

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [7]:
# Single line form

df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
df[df['W']>0]

# You dont get null values
# only rows which is True

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
resultsdf = df[df['W']>0]['Y']
resultsdf
#equals to below lines:
# resultsdf = df[df['W']>0]
# resultsdf['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [14]:
resultsdf = df[df['W']>0][['Y','Z']]
resultsdf

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

### Multiple Conditioning

In [15]:
df[(df['W']>0) & (df['Y']>0)]

# Instead of 'and' operator use '&'
# Instead of 'or' operator use '|' (Pip)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df.reset_index()

# For Specification: inplace = True

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [21]:
newind = 'CA NY  WY OR CO'.split()
# Returns list

['CA', 'NY', 'WY', 'OR', 'CO']

In [22]:
df['States'] = newind
# making new column
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [24]:
df.set_index('States')
# Overwrite on old indexes

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

### Multi-Indexing

In [3]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [4]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -1.068816 -0.471178
   2  0.546761 -2.811832
   3  2.642593 -0.432246
G2 1 -1.188038  0.789629
   2 -0.092345  0.819645
   3 -1.215103  0.647295

In [5]:
df.loc['G1'].loc[1]

A   -1.068816
B   -0.471178
Name: 1, dtype: float64

In [6]:
df.loc['G1'].loc[1]['B']

-0.47117835123238994

In [8]:
df.index.names = ['Groups','Num']
df

                   A         B
Groups Num
G1     1   -1.068816 -0.471178
       2    0.546761 -2.811832
       3    2.642593 -0.432246
G2     1   -1.188038  0.789629
       2   -0.092345  0.819645
       3   -1.215103  0.647295

In [9]:
# Cross sectioning with xs
df.xs('G1')

            A         B
Num
1   -1.068816 -0.471178
2    0.546761 -2.811832
3    2.642593 -0.432246

In [10]:
df.xs(1 , level = 'Num')

               A         B
Groups
G1     -1.068816 -0.471178
G2     -1.188038  0.789629

## Missing Values

In [12]:
d = {'A':[1,2,np.nan] ,'B':[5,np.nan,np.nan] , 'C':[1,2,3]}

# keys will be columns in df
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [14]:
# Drop missing values

df.dropna()

# Drop any rows with missing values
# by defult axis = 0

     A    B  C
0  1.0  5.0  1

In [15]:
# Drop any columns with missing values

df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [16]:
df.dropna(thresh = 2)

# Drop rows with at least to NaNs

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [17]:
# Fill missing values

df.fillna(value = df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

## Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [19]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [21]:
bycomp = df.groupby('Company')
bycomp

In [22]:
# Aggregate functions
# Usually for numerical values

bycomp.mean()

# bycomp.sum()
# bycomp.std()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [23]:
bycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [24]:
# Single line format

df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [25]:
df.groupby('Company').count()

# Count instanses

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [27]:
df.groupby('Company').min()
# df.groupby('Company').max()
# min and max also affect strings and sort them in person column

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [33]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [29]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [31]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64